k6/results/resource-comparison/20260430-222358-small-monitor/scale-out-small/200vu.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/scenarios/07-hot-room-fixed.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 4m0s max duration (incl. graceful stop):
              * hot_room_fixed: 1 iterations for each of 200 VUs (maxDuration: 3m30s, gracefulStop: 30s)


running (0m01.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m00.9s/3m30s  000/200 iters, 1 per VU

running (0m02.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m01.9s/3m30s  000/200 iters, 1 per VU

running (0m03.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m02.9s/3m30s  000/200 iters, 1 per VU

running (0m04.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m03.9s/3m30s  000/200 iters, 1 per VU

running (0m05.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m04.9s/3m30s  000/200 iters, 1 per VU

running (0m06.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m05.9s/3m30s  000/200 iters, 1 per VU

running (0m07.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m06.9s/3m30s  000/200 iters, 1 per VU

running (0m08.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m07.9s/3m30s  000/200 iters, 1 per VU

running (0m09.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m08.9s/3m30s  000/200 iters, 1 per VU

running (0m10.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m09.9s/3m30s  000/200 iters, 1 per VU

running (0m11.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m10.9s/3m30s  000/200 iters, 1 per VU

running (0m12.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m11.9s/3m30s  000/200 iters, 1 per VU

running (0m13.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m12.9s/3m30s  000/200 iters, 1 per VU

running (0m14.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m13.9s/3m30s  000/200 iters, 1 per VU

running (0m15.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m14.9s/3m30s  000/200 iters, 1 per VU

running (0m16.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m15.9s/3m30s  000/200 iters, 1 per VU

running (0m17.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m16.9s/3m30s  000/200 iters, 1 per VU

running (0m18.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m17.9s/3m30s  000/200 iters, 1 per VU

running (0m19.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m18.9s/3m30s  000/200 iters, 1 per VU

running (0m20.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m19.9s/3m30s  000/200 iters, 1 per VU

running (0m21.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m20.9s/3m30s  000/200 iters, 1 per VU

running (0m22.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m21.9s/3m30s  000/200 iters, 1 per VU

running (0m23.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m22.9s/3m30s  000/200 iters, 1 per VU

running (0m24.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m23.9s/3m30s  000/200 iters, 1 per VU

running (0m25.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m24.9s/3m30s  000/200 iters, 1 per VU

running (0m26.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m25.9s/3m30s  000/200 iters, 1 per VU

running (0m27.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m26.9s/3m30s  000/200 iters, 1 per VU

running (0m28.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m27.9s/3m30s  000/200 iters, 1 per VU

running (0m29.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m28.9s/3m30s  000/200 iters, 1 per VU

running (0m30.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m29.9s/3m30s  000/200 iters, 1 per VU

running (0m31.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m30.9s/3m30s  000/200 iters, 1 per VU

running (0m32.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m31.9s/3m30s  000/200 iters, 1 per VU

running (0m33.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m32.9s/3m30s  000/200 iters, 1 per VU

running (0m34.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m33.9s/3m30s  000/200 iters, 1 per VU

running (0m35.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m34.9s/3m30s  000/200 iters, 1 per VU

running (0m36.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m35.9s/3m30s  000/200 iters, 1 per VU

running (0m37.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m36.9s/3m30s  000/200 iters, 1 per VU

running (0m38.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m37.9s/3m30s  000/200 iters, 1 per VU

running (0m39.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m38.9s/3m30s  000/200 iters, 1 per VU

running (0m40.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m39.9s/3m30s  000/200 iters, 1 per VU

running (0m41.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m40.9s/3m30s  000/200 iters, 1 per VU

running (0m42.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m41.9s/3m30s  000/200 iters, 1 per VU

running (0m43.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m42.9s/3m30s  000/200 iters, 1 per VU

running (0m44.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m43.9s/3m30s  000/200 iters, 1 per VU

running (0m45.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m44.9s/3m30s  000/200 iters, 1 per VU

running (0m46.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m45.9s/3m30s  000/200 iters, 1 per VU

running (0m47.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m46.9s/3m30s  000/200 iters, 1 per VU

running (0m48.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m47.9s/3m30s  000/200 iters, 1 per VU

running (0m49.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m48.9s/3m30s  000/200 iters, 1 per VU

running (0m50.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m49.9s/3m30s  000/200 iters, 1 per VU

running (0m51.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m50.9s/3m30s  000/200 iters, 1 per VU

running (0m52.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m51.9s/3m30s  000/200 iters, 1 per VU

running (0m53.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m52.9s/3m30s  000/200 iters, 1 per VU

running (0m54.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m53.9s/3m30s  000/200 iters, 1 per VU

running (0m55.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m54.9s/3m30s  000/200 iters, 1 per VU

running (0m56.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m55.9s/3m30s  000/200 iters, 1 per VU

running (0m57.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m56.9s/3m30s  000/200 iters, 1 per VU

running (0m58.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m57.9s/3m30s  000/200 iters, 1 per VU

running (0m59.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m58.9s/3m30s  000/200 iters, 1 per VU

running (1m00.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  0m59.9s/3m30s  000/200 iters, 1 per VU

running (1m01.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m00.9s/3m30s  000/200 iters, 1 per VU

running (1m02.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m01.9s/3m30s  000/200 iters, 1 per VU

running (1m03.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m02.9s/3m30s  000/200 iters, 1 per VU

running (1m04.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m03.9s/3m30s  000/200 iters, 1 per VU

running (1m05.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m04.9s/3m30s  000/200 iters, 1 per VU

running (1m06.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m05.9s/3m30s  000/200 iters, 1 per VU

running (1m07.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m06.9s/3m30s  000/200 iters, 1 per VU

running (1m08.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m07.9s/3m30s  000/200 iters, 1 per VU

running (1m09.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m08.9s/3m30s  000/200 iters, 1 per VU

running (1m10.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m09.9s/3m30s  000/200 iters, 1 per VU

running (1m11.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m10.9s/3m30s  000/200 iters, 1 per VU

running (1m12.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m11.9s/3m30s  000/200 iters, 1 per VU

running (1m13.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m12.9s/3m30s  000/200 iters, 1 per VU

running (1m14.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m13.9s/3m30s  000/200 iters, 1 per VU

running (1m15.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m14.9s/3m30s  000/200 iters, 1 per VU

running (1m16.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m15.9s/3m30s  000/200 iters, 1 per VU

running (1m17.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m16.9s/3m30s  000/200 iters, 1 per VU

running (1m18.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m17.9s/3m30s  000/200 iters, 1 per VU

running (1m19.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m18.9s/3m30s  000/200 iters, 1 per VU

running (1m20.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m19.9s/3m30s  000/200 iters, 1 per VU

running (1m21.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m20.9s/3m30s  000/200 iters, 1 per VU

running (1m22.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m21.9s/3m30s  000/200 iters, 1 per VU

running (1m23.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m22.9s/3m30s  000/200 iters, 1 per VU

running (1m24.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m23.9s/3m30s  000/200 iters, 1 per VU

running (1m25.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m24.9s/3m30s  000/200 iters, 1 per VU

running (1m26.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m25.9s/3m30s  000/200 iters, 1 per VU

running (1m27.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m26.9s/3m30s  000/200 iters, 1 per VU

running (1m28.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m27.9s/3m30s  000/200 iters, 1 per VU

running (1m29.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m28.9s/3m30s  000/200 iters, 1 per VU

running (1m30.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m29.9s/3m30s  000/200 iters, 1 per VU

running (1m31.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m30.9s/3m30s  000/200 iters, 1 per VU

running (1m32.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m31.9s/3m30s  000/200 iters, 1 per VU

running (1m33.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m32.9s/3m30s  000/200 iters, 1 per VU

running (1m34.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m33.9s/3m30s  000/200 iters, 1 per VU

running (1m35.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m34.9s/3m30s  000/200 iters, 1 per VU

running (1m36.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m35.9s/3m30s  000/200 iters, 1 per VU

running (1m37.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m36.9s/3m30s  000/200 iters, 1 per VU

running (1m38.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m37.9s/3m30s  000/200 iters, 1 per VU

running (1m39.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m38.9s/3m30s  000/200 iters, 1 per VU

running (1m40.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m39.9s/3m30s  000/200 iters, 1 per VU

running (1m41.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m40.9s/3m30s  000/200 iters, 1 per VU

running (1m42.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m41.9s/3m30s  000/200 iters, 1 per VU

running (1m43.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m42.9s/3m30s  000/200 iters, 1 per VU

running (1m44.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m43.9s/3m30s  000/200 iters, 1 per VU

running (1m45.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m44.9s/3m30s  000/200 iters, 1 per VU

running (1m46.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m45.9s/3m30s  000/200 iters, 1 per VU

running (1m47.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m46.9s/3m30s  000/200 iters, 1 per VU

running (1m48.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m47.9s/3m30s  000/200 iters, 1 per VU

running (1m49.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m48.9s/3m30s  000/200 iters, 1 per VU

running (1m50.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m49.9s/3m30s  000/200 iters, 1 per VU

running (1m51.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m50.9s/3m30s  000/200 iters, 1 per VU

running (1m52.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m51.9s/3m30s  000/200 iters, 1 per VU

running (1m53.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m52.9s/3m30s  000/200 iters, 1 per VU

running (1m54.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m53.9s/3m30s  000/200 iters, 1 per VU

running (1m55.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m54.9s/3m30s  000/200 iters, 1 per VU

running (1m56.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m55.9s/3m30s  000/200 iters, 1 per VU

running (1m57.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m56.9s/3m30s  000/200 iters, 1 per VU

running (1m58.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m57.9s/3m30s  000/200 iters, 1 per VU

running (1m59.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m58.9s/3m30s  000/200 iters, 1 per VU

running (2m00.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 200 VUs  1m59.9s/3m30s  000/200 iters, 1 per VU

running (2m01.0s), 191/200 VUs, 9 complete and 0 interrupted iterations
hot_room_fixed   [   4% ] 200 VUs  2m00.9s/3m30s  009/200 iters, 1 per VU

running (2m02.0s), 009/200 VUs, 191 complete and 0 interrupted iterations
hot_room_fixed   [  96% ] 200 VUs  2m01.9s/3m30s  191/200 iters, 1 per VU


  █ THRESHOLDS 

    http_error_rate
    ✓ 'rate<0.01' rate=0.00%

    ws_connect_duration_ms
    ✓ 'p(95)<5000' p(95)=657.89ms
    ✓ 'p(99)<10000' p(99)=886.02ms

    ws_connect_success_rate
    ✓ 'rate>0.99' rate=100.00%

    ws_message_roundtrip_ms
    ✓ 'p(50)<5000' p(50)=18ms
    ✓ 'p(95)<60000' p(95)=112.04ms
    ✓ 'p(99)<120000' p(99)=402ms


  █ TOTAL RESULTS 

    checks_total.......: 804     6.576014/s
    checks_succeeded...: 100.00% 804 out of 804
    checks_failed......: 0.00%   0 out of 804

    ✓ login status 200
    ✓ login has token
    ✓ createHotRoom status 2xx
    ✓ createHotRoom has id
    ✓ enterRoom ok
    ✓ ws connected

    CUSTOM
    hot_room_broadcast_received_total...: 4764922 38972.880206/s
    hot_room_own_echo_received_total....: 23800   194.663113/s
    hot_room_unique_received_total......: 4764922 38972.880206/s
    http_error_rate.....................: 0.00%   0 out of 402
    rest_create_room_duration_ms........: avg=39.4ms   min=39.4ms   med=39.4ms   max=39.4ms   p(90)=39.4ms   p(95)=39.4ms  
    rest_enter_room_duration_ms.........: avg=882.73ms min=215.15ms med=902.31ms max=1.79s    p(90)=1.29s    p(95)=1.39s   
    rest_login_duration_ms..............: avg=269ms    min=11.28ms  med=221.39ms max=1.3s     p(90)=494.95ms p(95)=616.54ms

    HTTP
    http_req_duration...................: avg=573.77ms min=11.28ms  med=495.16ms max=1.79s    p(90)=1.19s    p(95)=1.29s   
      { expected_response:true }........: avg=573.77ms min=11.28ms  med=495.16ms max=1.79s    p(90)=1.19s    p(95)=1.29s   
    http_req_failed.....................: 0.00%   0 out of 402
    http_reqs...........................: 402     3.288007/s

    EXECUTION
    iteration_duration..................: avg=2m1s     min=2m0s     med=2m1s     max=2m2s     p(90)=2m1s     p(95)=2m1s    
    iterations..........................: 200     1.635824/s
    vus.................................: 9       min=9          max=200
    vus_max.............................: 200     min=200        max=200

    NETWORK
    data_received.......................: 1.4 GB  11 MB/s
    data_sent...........................: 2.6 MB  21 kB/s

    WEBSOCKET
    ws_connect_duration_ms..............: avg=158.76ms min=3ms      med=99ms     max=961ms    p(90)=303.5ms  p(95)=657.89ms
    ws_connect_success_rate.............: 100.00% 200 out of 200
    ws_connecting.......................: avg=158.7ms  min=3.13ms   med=98.98ms  max=960.88ms p(90)=303.21ms p(95)=658.05ms
    ws_message_roundtrip_ms.............: avg=35.47ms  min=5ms      med=18ms     max=993ms    p(90)=44ms     p(95)=112.04ms
    ws_messages_received_total..........: 4764922 38972.880206/s
    ws_messages_sent_total..............: 23853   195.096606/s
    ws_msgs_received....................: 4764922 38972.880206/s
    ws_msgs_sent........................: 23853   195.096606/s
    ws_session_duration.................: avg=2m0s     min=2m0s     med=2m0s     max=2m0s     p(90)=2m0s     p(95)=2m0s    
    ws_sessions.........................: 200     1.635824/s



running (2m02.3s), 000/200 VUs, 200 complete and 0 interrupted iterations
hot_room_fixed ✓ [ 100% ] 200 VUs  2m02.2s/3m30s  200/200 iters, 1 per VU